Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/pic32cm_sg00_curiosity_pro_trustzone/pic32cm_sg00_curiosity_pro/src/packs/PIC32CM5112SG00100_DFP/component/dsu.h
/*
 * Component description for DSU
 *
 * Copyright (c) 2024 Microchip Technology Inc. and its subsidiaries.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/*  file generated from device description file (ATDF) version 2024-07-26T17:56:43Z  */
#ifndef _PIC32CMSG00_DSU_COMPONENT_H_
#define _PIC32CMSG00_DSU_COMPONENT_H_

/* ************************************************************************** */
/*                      SOFTWARE API DEFINITION FOR DSU                       */
/* ************************************************************************** */

/* -------- DSU_CTRLA : (DSU Offset: 0x00) (R/W 32) Control A REGISTER -------- */
#define DSU_CTRLA_RESETVALUE                  _UINT32_(0x00)                                       /*  (DSU_CTRLA) Control A REGISTER  Reset Value */

#define DSU_CTRLA_PRIV_Pos                    _UINT32_(2)                                          /* (DSU_CTRLA) Privileged Access Only for APB Interface Position */
#define DSU_CTRLA_PRIV_Msk                    (_UINT32_(0x1) << DSU_CTRLA_PRIV_Pos)                /* (DSU_CTRLA) Privileged Access Only for APB Interface Mask */
#define DSU_CTRLA_PRIV(value)                 (DSU_CTRLA_PRIV_Msk & (_UINT32_(value) << DSU_CTRLA_PRIV_Pos)) /* Assignment of value for PRIV in the DSU_CTRLA register */
#define   DSU_CTRLA_PRIV_0_Val                _UINT32_(0x0)                                        /* (DSU_CTRLA) Internal Address Space registers accessible in privileged and unprivileged modes. Test functions generate unprivileged requests.  */
#define   DSU_CTRLA_PRIV_1_Val                _UINT32_(0x1)                                        /* (DSU_CTRLA) Internal Address Space registers only accessible in privileged mode. Test functions generate privileged requests.  */
#define DSU_CTRLA_PRIV_0                      (DSU_CTRLA_PRIV_0_Val << DSU_CTRLA_PRIV_Pos)         /* (DSU_CTRLA) Internal Address Space registers accessible in privileged and unprivileged modes. Test functions generate unprivileged requests. Position */
#define DSU_CTRLA_PRIV_1                      (DSU_CTRLA_PRIV_1_Val << DSU_CTRLA_PRIV_Pos)         /* (DSU_CTRLA) Internal Address Space registers only accessible in privileged mode. Test functions generate privileged requests. Position */
#define DSU_CTRLA_Msk                         _UINT32_(0x00000004)                                 /* (DSU_CTRLA) Register Mask  */


/* -------- DSU_CTRLB : (DSU Offset: 0x04) (R/W 32) Control B REGISTER -------- */
#define DSU_CTRLB_RESETVALUE                  _UINT32_(0x00)                                       /*  (DSU_CTRLB) Control B REGISTER  Reset Value */

#define DSU_CTRLB_DCCDMALVL0_Pos              _UINT32_(0)                                          /* (DSU_CTRLB) DMA Trigger n Level Position */
#define DSU_CTRLB_DCCDMALVL0_Msk              (_UINT32_(0x1) << DSU_CTRLB_DCCDMALVL0_Pos)          /* (DSU_CTRLB) DMA Trigger n Level Mask */
#define DSU_CTRLB_DCCDMALVL0(value)           (DSU_CTRLB_DCCDMALVL0_Msk & (_UINT32_(value) << DSU_CTRLB_DCCDMALVL0_Pos)) /* Assignment of value for DCCDMALVL0 in the DSU_CTRLB register */
#define   DSU_CTRLB_DCCDMALVL0_EMPTY_Val      _UINT32_(0x0)                                        /* (DSU_CTRLB) Trigger n rises when DCCn is read and falls when it is written  */
#define   DSU_CTRLB_DCCDMALVL0_FULL_Val       _UINT32_(0x1)                                        /* (DSU_CTRLB) Trigger n rises when DCCn is written and falls when it is read  */
#define DSU_CTRLB_DCCDMALVL0_EMPTY            (DSU_CTRLB_DCCDMALVL0_EMPTY_Val << DSU_CTRLB_DCCDMALVL0_Pos) /* (DSU_CTRLB) Trigger n rises when DCCn is read and falls when it is written Position */
#define DSU_CTRLB_DCCDMALVL0_FULL             (DSU_CTRLB_DCCDMALVL0_FULL_Val << DSU_CTRLB_DCCDMALVL0_Pos) /* (DSU_CTRLB) Trigger n rises when DCCn is written and falls when it is read Position */
#define DSU_CTRLB_DCCDMALVL1_Pos              _UINT32_(1)                                          /* (DSU_CTRLB) DMA Trigger n Level Position */
#define DSU_CTRLB_DCCDMALVL1_Msk              (_UINT32_(0x1) << DSU_CTRLB_DCCDMALVL1_Pos)          /* (DSU_CTRLB) DMA Trigger n Level Mask */
#define DSU_CTRLB_DCCDMALVL1(value)           (DSU_CTRLB_DCCDMALVL1_Msk & (_UINT32_(value) << DSU_CTRLB_DCCDMALVL1_Pos)) /* Assignment of value for DCCDMALVL1 in the DSU_CTRLB register */
#define   DSU_CTRLB_DCCDMALVL1_EMPTY_Val      _UINT32_(0x0)                                        /* (DSU_CTRLB) Trigger n rises when DCCn is read and falls when it is written  */
#define   DSU_CTRLB_DCCDMALVL1_FULL_Val       _UINT32_(0x1)                                        /* (DSU_CTRLB) Trigger n rises when DCCn is written and falls when it is read  */
#define DSU_CTRLB_DCCDMALVL1_EMPTY            (DSU_CTRLB_DCCDMALVL1_EMPTY_Val << DSU_CTRLB_DCCDMALVL1_Pos) /* (DSU_CTRLB) Trigger n rises when DCCn is read and falls when it is written Position */
#define DSU_CTRLB_DCCDMALVL1_FULL             (DSU_CTRLB_DCCDMALVL1_FULL_Val << DSU_CTRLB_DCCDMALVL1_Pos) /* (DSU_CTRLB) Trigger n rises when DCCn is written and falls when it is read Position */
#define DSU_CTRLB_MISC_Pos                    _UINT32_(8)                                          /* (DSU_CTRLB) Device Specific Configuration Register Position */
#define DSU_CTRLB_MISC_Msk                    (_UINT32_(0xFFFFFF) << DSU_CTRLB_MISC_Pos)           /* (DSU_CTRLB) Device Specific Configuration Register Mask */
#define DSU_CTRLB_MISC(value)                 (DSU_CTRLB_MISC_Msk & (_UINT32_(value) << DSU_CTRLB_MISC_Pos)) /* Assignment of value for MISC in the DSU_CTRLB register */
#define DSU_CTRLB_Msk                         _UINT32_(0xFFFFFF03)                                 /* (DSU_CTRLB) Register Mask  */

