Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/pic32cm_sg00_curiosity_pro_trustzone/pic32cm_sg00_curiosity_pro/src/packs/PIC32CM5112SG00100_DFP/component/dsu.h
#define DSU_CTRLB_DCCDMALVL_Pos               _UINT32_(0)                                          /* (DSU_CTRLB Position) DMA Trigger n Level */
#define DSU_CTRLB_DCCDMALVL_Msk               (_UINT32_(0x3) << DSU_CTRLB_DCCDMALVL_Pos)           /* (DSU_CTRLB Mask) DCCDMALVL */
#define DSU_CTRLB_DCCDMALVL(value)            (DSU_CTRLB_DCCDMALVL_Msk & (_UINT32_(value) << DSU_CTRLB_DCCDMALVL_Pos)) 

/* -------- DSU_CTRLC : (DSU Offset: 0x100) (R/W 32) Control C REGISTER -------- */
#define DSU_CTRLC_RESETVALUE                  _UINT32_(0x00)                                       /*  (DSU_CTRLC) Control C REGISTER  Reset Value */

#define DSU_CTRLC_DBGRW0_Pos                  _UINT32_(0)                                          /* (DSU_CTRLC) CPUn Debug R/W Position */
#define DSU_CTRLC_DBGRW0_Msk                  (_UINT32_(0x1) << DSU_CTRLC_DBGRW0_Pos)              /* (DSU_CTRLC) CPUn Debug R/W Mask */
#define DSU_CTRLC_DBGRW0(value)               (DSU_CTRLC_DBGRW0_Msk & (_UINT32_(value) << DSU_CTRLC_DBGRW0_Pos)) /* Assignment of value for DBGRW0 in the DSU_CTRLC register */
#define   DSU_CTRLC_DBGRW0_0_Val              _UINT32_(0x0)                                        /* (DSU_CTRLC) Allow debugger accesses through CPUn to carry the debug attribute (i.e debugger reads are non-destructive).  */
#define   DSU_CTRLC_DBGRW0_1_Val              _UINT32_(0x1)                                        /* (DSU_CTRLC) Debugger accesses through CPUn do not carry the debug attribute (i.e debugger reads are destructive).  */
#define DSU_CTRLC_DBGRW0_0                    (DSU_CTRLC_DBGRW0_0_Val << DSU_CTRLC_DBGRW0_Pos)     /* (DSU_CTRLC) Allow debugger accesses through CPUn to carry the debug attribute (i.e debugger reads are non-destructive). Position */
#define DSU_CTRLC_DBGRW0_1                    (DSU_CTRLC_DBGRW0_1_Val << DSU_CTRLC_DBGRW0_Pos)     /* (DSU_CTRLC) Debugger accesses through CPUn do not carry the debug attribute (i.e debugger reads are destructive). Position */
#define DSU_CTRLC_Msk                         _UINT32_(0x00000001)                                 /* (DSU_CTRLC) Register Mask  */

#define DSU_CTRLC_DBGRW_Pos                   _UINT32_(0)                                          /* (DSU_CTRLC Position) CPUn Debug R/W */
#define DSU_CTRLC_DBGRW_Msk                   (_UINT32_(0x1) << DSU_CTRLC_DBGRW_Pos)               /* (DSU_CTRLC Mask) DBGRW */
#define DSU_CTRLC_DBGRW(value)                (DSU_CTRLC_DBGRW_Msk & (_UINT32_(value) << DSU_CTRLC_DBGRW_Pos)) 

/* -------- DSU_STATUSA : (DSU Offset: 0x104) (R/W 32) Status A REGISTER -------- */
#define DSU_STATUSA_RESETVALUE                _UINT32_(0x00)                                       /*  (DSU_STATUSA) Status A REGISTER  Reset Value */

#define DSU_STATUSA_DONE_Pos                  _UINT32_(0)                                          /* (DSU_STATUSA) Done Status Position */
#define DSU_STATUSA_DONE_Msk                  (_UINT32_(0x1) << DSU_STATUSA_DONE_Pos)              /* (DSU_STATUSA) Done Status Mask */
#define DSU_STATUSA_DONE(value)               (DSU_STATUSA_DONE_Msk & (_UINT32_(value) << DSU_STATUSA_DONE_Pos)) /* Assignment of value for DONE in the DSU_STATUSA register */
#define   DSU_STATUSA_DONE_0_Val              _UINT32_(0x0)                                        /* (DSU_STATUSA) DSU is executing a command or idle.  */
#define   DSU_STATUSA_DONE_1_Val              _UINT32_(0x1)                                        /* (DSU_STATUSA) TCTRL.CMD command completed  */
#define DSU_STATUSA_DONE_0                    (DSU_STATUSA_DONE_0_Val << DSU_STATUSA_DONE_Pos)     /* (DSU_STATUSA) DSU is executing a command or idle. Position */
#define DSU_STATUSA_DONE_1                    (DSU_STATUSA_DONE_1_Val << DSU_STATUSA_DONE_Pos)     /* (DSU_STATUSA) TCTRL.CMD command completed Position */
#define DSU_STATUSA_BERR_Pos                  _UINT32_(2)                                          /* (DSU_STATUSA) Bus Error Status Position */
#define DSU_STATUSA_BERR_Msk                  (_UINT32_(0x1) << DSU_STATUSA_BERR_Pos)              /* (DSU_STATUSA) Bus Error Status Mask */
#define DSU_STATUSA_BERR(value)               (DSU_STATUSA_BERR_Msk & (_UINT32_(value) << DSU_STATUSA_BERR_Pos)) /* Assignment of value for BERR in the DSU_STATUSA register */
#define   DSU_STATUSA_BERR_0_Val              _UINT32_(0x0)                                        /* (DSU_STATUSA) No bus error detected  */
#define   DSU_STATUSA_BERR_1_Val              _UINT32_(0x1)                                        /* (DSU_STATUSA) Bus error incurred while performing the DSU command.  */
#define DSU_STATUSA_BERR_0                    (DSU_STATUSA_BERR_0_Val << DSU_STATUSA_BERR_Pos)     /* (DSU_STATUSA) No bus error detected Position */
#define DSU_STATUSA_BERR_1                    (DSU_STATUSA_BERR_1_Val << DSU_STATUSA_BERR_Pos)     /* (DSU_STATUSA) Bus error incurred while performing the DSU command. Position */
#define DSU_STATUSA_PERR_Pos                  _UINT32_(3)                                          /* (DSU_STATUSA) Protection Error Status Position */
#define DSU_STATUSA_PERR_Msk                  (_UINT32_(0x1) << DSU_STATUSA_PERR_Pos)              /* (DSU_STATUSA) Protection Error Status Mask */
#define DSU_STATUSA_PERR(value)               (DSU_STATUSA_PERR_Msk & (_UINT32_(value) << DSU_STATUSA_PERR_Pos)) /* Assignment of value for PERR in the DSU_STATUSA register */
#define   DSU_STATUSA_PERR_0_Val              _UINT32_(0x0)                                        /* (DSU_STATUSA) No protection error detected  */
#define   DSU_STATUSA_PERR_1_Val              _UINT32_(0x1)                                        /* (DSU_STATUSA) Invalid command written to TCTRL.CMD, partial write to the upper or lower bytes of TCTRL.CMD, or invalid key written to SAFEDOOR.  */
#define DSU_STATUSA_PERR_0                    (DSU_STATUSA_PERR_0_Val << DSU_STATUSA_PERR_Pos)     /* (DSU_STATUSA) No protection error detected Position */
#define DSU_STATUSA_PERR_1                    (DSU_STATUSA_PERR_1_Val << DSU_STATUSA_PERR_Pos)     /* (DSU_STATUSA) Invalid command written to TCTRL.CMD, partial write to the upper or lower bytes of TCTRL.CMD, or invalid key written to SAFEDOOR. Position */
#define DSU_STATUSA_ROMCRC_Pos                _UINT32_(6)                                          /* (DSU_STATUSA) Boot ROM CRC Self-Check Status Position */
#define DSU_STATUSA_ROMCRC_Msk                (_UINT32_(0x3) << DSU_STATUSA_ROMCRC_Pos)            /* (DSU_STATUSA) Boot ROM CRC Self-Check Status Mask */
#define DSU_STATUSA_ROMCRC(value)             (DSU_STATUSA_ROMCRC_Msk & (_UINT32_(value) << DSU_STATUSA_ROMCRC_Pos)) /* Assignment of value for ROMCRC in the DSU_STATUSA register */
#define   DSU_STATUSA_ROMCRC_0_Val            _UINT32_(0x0)                                        /* (DSU_STATUSA) CRC is in progress  */
#define   DSU_STATUSA_ROMCRC_1_Val            _UINT32_(0x1)                                        /* (DSU_STATUSA) CRC completed but failed indicating possible issue with the ROM content. System held in lockup state.  */
#define   DSU_STATUSA_ROMCRC_2_Val            _UINT32_(0x2)                                        /* (DSU_STATUSA) CRC completed and passed  */
#define   DSU_STATUSA_ROMCRC_3_Val            _UINT32_(0x3)                                        /* (DSU_STATUSA) CRC never executed because user disabled CRC check through fuse settings.  */
#define DSU_STATUSA_ROMCRC_0                  (DSU_STATUSA_ROMCRC_0_Val << DSU_STATUSA_ROMCRC_Pos) /* (DSU_STATUSA) CRC is in progress Position */
#define DSU_STATUSA_ROMCRC_1                  (DSU_STATUSA_ROMCRC_1_Val << DSU_STATUSA_ROMCRC_Pos) /* (DSU_STATUSA) CRC completed but failed indicating possible issue with the ROM content. System held in lockup state. Position */
#define DSU_STATUSA_ROMCRC_2                  (DSU_STATUSA_ROMCRC_2_Val << DSU_STATUSA_ROMCRC_Pos) /* (DSU_STATUSA) CRC completed and passed Position */
#define DSU_STATUSA_ROMCRC_3                  (DSU_STATUSA_ROMCRC_3_Val << DSU_STATUSA_ROMCRC_Pos) /* (DSU_STATUSA) CRC never executed because user disabled CRC check through fuse settings. Position */
#define DSU_STATUSA_CRSTEXT0_Pos              _UINT32_(8)                                          /* (DSU_STATUSA) CPUx Reset Extension Status Position */
#define DSU_STATUSA_CRSTEXT0_Msk              (_UINT32_(0x1) << DSU_STATUSA_CRSTEXT0_Pos)          /* (DSU_STATUSA) CPUx Reset Extension Status Mask */
#define DSU_STATUSA_CRSTEXT0(value)           (DSU_STATUSA_CRSTEXT0_Msk & (_UINT32_(value) << DSU_STATUSA_CRSTEXT0_Pos)) /* Assignment of value for CRSTEXT0 in the DSU_STATUSA register */
#define   DSU_STATUSA_CRSTEXT0_0_Val          _UINT32_(0x0)                                        /* (DSU_STATUSA) CPUx released from reset extension.  */
#define   DSU_STATUSA_CRSTEXT0_1_Val          _UINT32_(0x1)                                        /* (DSU_STATUSA) CPUx held in reset extension. Set on Cold-Plugging detection.  */
#define DSU_STATUSA_CRSTEXT0_0                (DSU_STATUSA_CRSTEXT0_0_Val << DSU_STATUSA_CRSTEXT0_Pos) /* (DSU_STATUSA) CPUx released from reset extension. Position */
#define DSU_STATUSA_CRSTEXT0_1                (DSU_STATUSA_CRSTEXT0_1_Val << DSU_STATUSA_CRSTEXT0_Pos) /* (DSU_STATUSA) CPUx held in reset extension. Set on Cold-Plugging detection. Position */
#define DSU_STATUSA_BREXT0_Pos                _UINT32_(16)                                         /* (DSU_STATUSA) BootRom 0 Phase Extension Status Position */
#define DSU_STATUSA_BREXT0_Msk                (_UINT32_(0x1) << DSU_STATUSA_BREXT0_Pos)            /* (DSU_STATUSA) BootRom 0 Phase Extension Status Mask */
#define DSU_STATUSA_BREXT0(value)             (DSU_STATUSA_BREXT0_Msk & (_UINT32_(value) << DSU_STATUSA_BREXT0_Pos)) /* Assignment of value for BREXT0 in the DSU_STATUSA register */
#define   DSU_STATUSA_BREXT0_0_Val            _UINT32_(0x0)                                        /* (DSU_STATUSA) Boot ROM Phase Extension released for CPUx.  */
#define   DSU_STATUSA_BREXT0_1_Val            _UINT32_(0x1)                                        /* (DSU_STATUSA) Boot ROM Phase Extension for CPUx. Set on Cold-Plugging detection.  */
#define DSU_STATUSA_BREXT0_0                  (DSU_STATUSA_BREXT0_0_Val << DSU_STATUSA_BREXT0_Pos) /* (DSU_STATUSA) Boot ROM Phase Extension released for CPUx. Position */
#define DSU_STATUSA_BREXT0_1                  (DSU_STATUSA_BREXT0_1_Val << DSU_STATUSA_BREXT0_Pos) /* (DSU_STATUSA) Boot ROM Phase Extension for CPUx. Set on Cold-Plugging detection. Position */
#define DSU_STATUSA_Msk                       _UINT32_(0x000101CD)                                 /* (DSU_STATUSA) Register Mask  */

#define DSU_STATUSA_CRSTEXT_Pos               _UINT32_(8)                                          /* (DSU_STATUSA Position) CPUx Reset Extension Status */
#define DSU_STATUSA_CRSTEXT_Msk               (_UINT32_(0x1) << DSU_STATUSA_CRSTEXT_Pos)           /* (DSU_STATUSA Mask) CRSTEXT */
#define DSU_STATUSA_CRSTEXT(value)            (DSU_STATUSA_CRSTEXT_Msk & (_UINT32_(value) << DSU_STATUSA_CRSTEXT_Pos)) 
#define DSU_STATUSA_BREXT_Pos                 _UINT32_(16)                                         /* (DSU_STATUSA Position) BootRom x Phase Extension Status */
#define DSU_STATUSA_BREXT_Msk                 (_UINT32_(0x1) << DSU_STATUSA_BREXT_Pos)             /* (DSU_STATUSA Mask) BREXT */
#define DSU_STATUSA_BREXT(value)              (DSU_STATUSA_BREXT_Msk & (_UINT32_(value) << DSU_STATUSA_BREXT_Pos)) 

/* -------- DSU_STATUSB : (DSU Offset: 0x108) ( R/ 32) Status B REGISTER -------- */
#define DSU_STATUSB_RESETVALUE                _UINT32_(0x00)                                       /*  (DSU_STATUSB) Status B REGISTER  Reset Value */

#define DSU_STATUSB_BCCD0_Pos                 _UINT32_(0)                                          /* (DSU_STATUSB) Boot ROM Communication Channel 0 Dirty Position */
#define DSU_STATUSB_BCCD0_Msk                 (_UINT32_(0x1) << DSU_STATUSB_BCCD0_Pos)             /* (DSU_STATUSB) Boot ROM Communication Channel 0 Dirty Mask */
#define DSU_STATUSB_BCCD0(value)              (DSU_STATUSB_BCCD0_Msk & (_UINT32_(value) << DSU_STATUSB_BCCD0_Pos)) /* Assignment of value for BCCD0 in the DSU_STATUSB register */
#define   DSU_STATUSB_BCCD0_0_Val             _UINT32_(0x0)                                        /* (DSU_STATUSB) BCCDx.DATA register was read from.  */
#define   DSU_STATUSB_BCCD0_1_Val             _UINT32_(0x1)                                        /* (DSU_STATUSB) BCCDx.DATA register was written to.  */
#define DSU_STATUSB_BCCD0_0                   (DSU_STATUSB_BCCD0_0_Val << DSU_STATUSB_BCCD0_Pos)   /* (DSU_STATUSB) BCCDx.DATA register was read from. Position */
#define DSU_STATUSB_BCCD0_1                   (DSU_STATUSB_BCCD0_1_Val << DSU_STATUSB_BCCD0_Pos)   /* (DSU_STATUSB) BCCDx.DATA register was written to. Position */
#define DSU_STATUSB_BCCD1_Pos                 _UINT32_(1)                                          /* (DSU_STATUSB) Boot ROM Communication Channel 1 Dirty Position */
#define DSU_STATUSB_BCCD1_Msk                 (_UINT32_(0x1) << DSU_STATUSB_BCCD1_Pos)             /* (DSU_STATUSB) Boot ROM Communication Channel 1 Dirty Mask */
#define DSU_STATUSB_BCCD1(value)              (DSU_STATUSB_BCCD1_Msk & (_UINT32_(value) << DSU_STATUSB_BCCD1_Pos)) /* Assignment of value for BCCD1 in the DSU_STATUSB register */
#define   DSU_STATUSB_BCCD1_0_Val             _UINT32_(0x0)                                        /* (DSU_STATUSB) BCCDx.DATA register was read from.  */
#define   DSU_STATUSB_BCCD1_1_Val             _UINT32_(0x1)                                        /* (DSU_STATUSB) BCCDx.DATA register was written to.  */
#define DSU_STATUSB_BCCD1_0                   (DSU_STATUSB_BCCD1_0_Val << DSU_STATUSB_BCCD1_Pos)   /* (DSU_STATUSB) BCCDx.DATA register was read from. Position */
#define DSU_STATUSB_BCCD1_1                   (DSU_STATUSB_BCCD1_1_Val << DSU_STATUSB_BCCD1_Pos)   /* (DSU_STATUSB) BCCDx.DATA register was written to. Position */
#define DSU_STATUSB_DCCD0_Pos                 _UINT32_(2)                                          /* (DSU_STATUSB) Debug Communication Channel 0 Dirty Position */
#define DSU_STATUSB_DCCD0_Msk                 (_UINT32_(0x1) << DSU_STATUSB_DCCD0_Pos)             /* (DSU_STATUSB) Debug Communication Channel 0 Dirty Mask */
#define DSU_STATUSB_DCCD0(value)              (DSU_STATUSB_DCCD0_Msk & (_UINT32_(value) << DSU_STATUSB_DCCD0_Pos)) /* Assignment of value for DCCD0 in the DSU_STATUSB register */
#define   DSU_STATUSB_DCCD0_0_Val             _UINT32_(0x0)                                        /* (DSU_STATUSB) DCCDx.DATA register was read from.  */
#define   DSU_STATUSB_DCCD0_1_Val             _UINT32_(0x1)                                        /* (DSU_STATUSB) DCCDx.DATA register was written to.  */
#define DSU_STATUSB_DCCD0_0                   (DSU_STATUSB_DCCD0_0_Val << DSU_STATUSB_DCCD0_Pos)   /* (DSU_STATUSB) DCCDx.DATA register was read from. Position */
#define DSU_STATUSB_DCCD0_1                   (DSU_STATUSB_DCCD0_1_Val << DSU_STATUSB_DCCD0_Pos)   /* (DSU_STATUSB) DCCDx.DATA register was written to. Position */
#define DSU_STATUSB_DCCD1_Pos                 _UINT32_(3)                                          /* (DSU_STATUSB) Debug Communication Channel 1 Dirty Position */
#define DSU_STATUSB_DCCD1_Msk                 (_UINT32_(0x1) << DSU_STATUSB_DCCD1_Pos)             /* (DSU_STATUSB) Debug Communication Channel 1 Dirty Mask */
#define DSU_STATUSB_DCCD1(value)              (DSU_STATUSB_DCCD1_Msk & (_UINT32_(value) << DSU_STATUSB_DCCD1_Pos)) /* Assignment of value for DCCD1 in the DSU_STATUSB register */
#define   DSU_STATUSB_DCCD1_0_Val             _UINT32_(0x0)                                        /* (DSU_STATUSB) DCCDx.DATA register was read from.  */
#define   DSU_STATUSB_DCCD1_1_Val             _UINT32_(0x1)                                        /* (DSU_STATUSB) DCCDx.DATA register was written to.  */
#define DSU_STATUSB_DCCD1_0                   (DSU_STATUSB_DCCD1_0_Val << DSU_STATUSB_DCCD1_Pos)   /* (DSU_STATUSB) DCCDx.DATA register was read from. Position */
#define DSU_STATUSB_DCCD1_1                   (DSU_STATUSB_DCCD1_1_Val << DSU_STATUSB_DCCD1_Pos)   /* (DSU_STATUSB) DCCDx.DATA register was written to. Position */
#define DSU_STATUSB_DBGPRES_Pos               _UINT32_(8)                                          /* (DSU_STATUSB) Debugger Present Status Position */
#define DSU_STATUSB_DBGPRES_Msk               (_UINT32_(0x1) << DSU_STATUSB_DBGPRES_Pos)           /* (DSU_STATUSB) Debugger Present Status Mask */
#define DSU_STATUSB_DBGPRES(value)            (DSU_STATUSB_DBGPRES_Msk & (_UINT32_(value) << DSU_STATUSB_DBGPRES_Pos)) /* Assignment of value for DBGPRES in the DSU_STATUSB register */
#define   DSU_STATUSB_DBGPRES_0_Val           _UINT32_(0x0)                                        /* (DSU_STATUSB) No debugger detected  */
#define   DSU_STATUSB_DBGPRES_1_Val           _UINT32_(0x1)                                        /* (DSU_STATUSB) Debugger probe detected  */
#define DSU_STATUSB_DBGPRES_0                 (DSU_STATUSB_DBGPRES_0_Val << DSU_STATUSB_DBGPRES_Pos) /* (DSU_STATUSB) No debugger detected Position */
#define DSU_STATUSB_DBGPRES_1                 (DSU_STATUSB_DBGPRES_1_Val << DSU_STATUSB_DBGPRES_Pos) /* (DSU_STATUSB) Debugger probe detected Position */
#define DSU_STATUSB_HPS_Pos                   _UINT32_(10)                                         /* (DSU_STATUSB) Hot-Plugging Status Position */
#define DSU_STATUSB_HPS_Msk                   (_UINT32_(0x1) << DSU_STATUSB_HPS_Pos)               /* (DSU_STATUSB) Hot-Plugging Status Mask */
#define DSU_STATUSB_HPS(value)                (DSU_STATUSB_HPS_Msk & (_UINT32_(value) << DSU_STATUSB_HPS_Pos)) /* Assignment of value for HPS in the DSU_STATUSB register */
#define   DSU_STATUSB_HPS_0_Val               _UINT32_(0x0)                                        /* (DSU_STATUSB) Hot-Plugging inactive  */
#define   DSU_STATUSB_HPS_1_Val               _UINT32_(0x1)                                        /* (DSU_STATUSB) Hot-Plugging active  */
#define DSU_STATUSB_HPS_0                     (DSU_STATUSB_HPS_0_Val << DSU_STATUSB_HPS_Pos)       /* (DSU_STATUSB) Hot-Plugging inactive Position */
#define DSU_STATUSB_HPS_1                     (DSU_STATUSB_HPS_1_Val << DSU_STATUSB_HPS_Pos)       /* (DSU_STATUSB) Hot-Plugging active Position */
#define DSU_STATUSB_Msk                       _UINT32_(0x0000050F)                                 /* (DSU_STATUSB) Register Mask  */

#define DSU_STATUSB_BCCD_Pos                  _UINT32_(0)                                          /* (DSU_STATUSB Position) Boot ROM Communication Channel x Dirty */
#define DSU_STATUSB_BCCD_Msk                  (_UINT32_(0x3) << DSU_STATUSB_BCCD_Pos)              /* (DSU_STATUSB Mask) BCCD */
#define DSU_STATUSB_BCCD(value)               (DSU_STATUSB_BCCD_Msk & (_UINT32_(value) << DSU_STATUSB_BCCD_Pos)) 
#define DSU_STATUSB_DCCD_Pos                  _UINT32_(2)                                          /* (DSU_STATUSB Position) Debug Communication Channel x Dirty */
#define DSU_STATUSB_DCCD_Msk                  (_UINT32_(0x3) << DSU_STATUSB_DCCD_Pos)              /* (DSU_STATUSB Mask) DCCD */
#define DSU_STATUSB_DCCD(value)               (DSU_STATUSB_DCCD_Msk & (_UINT32_(value) << DSU_STATUSB_DCCD_Pos)) 

/* -------- DSU_BCC : (DSU Offset: 0x110) (R/W 32) Boot ROM Channel n REGISTER -------- */
#define DSU_BCC_RESETVALUE                    _UINT32_(0x00)                                       /*  (DSU_BCC) Boot ROM Channel n REGISTER  Reset Value */

#define DSU_BCC_DATA_Pos                      _UINT32_(0)                                          /* (DSU_BCC) Data Position */
#define DSU_BCC_DATA_Msk                      (_UINT32_(0xFFFFFFFF) << DSU_BCC_DATA_Pos)           /* (DSU_BCC) Data Mask */
#define DSU_BCC_DATA(value)                   (DSU_BCC_DATA_Msk & (_UINT32_(value) << DSU_BCC_DATA_Pos)) /* Assignment of value for DATA in the DSU_BCC register */
#define DSU_BCC_Msk                           _UINT32_(0xFFFFFFFF)                                 /* (DSU_BCC) Register Mask  */


