Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/pic32cm_sg00_curiosity_pro_trustzone/pic32cm_sg00_curiosity_pro/src/packs/PIC32CM5112SG00100_DFP/component/dsu.h
/* -------- DSU_ENTRY6 : (DSU Offset: 0x1018) ( R/ 32) CoreSight ROM Table Entry 6 Register -------- */
#define DSU_ENTRY6_RESETVALUE                 _UINT32_(0x00)                                       /*  (DSU_ENTRY6) CoreSight ROM Table Entry 6 Register  Reset Value */

#define DSU_ENTRY6_EPRES_Pos                  _UINT32_(0)                                          /* (DSU_ENTRY6) CoreSight Entry Present Position */
#define DSU_ENTRY6_EPRES_Msk                  (_UINT32_(0x1) << DSU_ENTRY6_EPRES_Pos)              /* (DSU_ENTRY6) CoreSight Entry Present Mask */
#define DSU_ENTRY6_EPRES(value)               (DSU_ENTRY6_EPRES_Msk & (_UINT32_(value) << DSU_ENTRY6_EPRES_Pos)) /* Assignment of value for EPRES in the DSU_ENTRY6 register */
#define   DSU_ENTRY6_EPRES_0_Val              _UINT32_(0x0)                                        /* (DSU_ENTRY6) Entry not present  */
#define   DSU_ENTRY6_EPRES_1_Val              _UINT32_(0x1)                                        /* (DSU_ENTRY6) Entry present  */
#define DSU_ENTRY6_EPRES_0                    (DSU_ENTRY6_EPRES_0_Val << DSU_ENTRY6_EPRES_Pos)     /* (DSU_ENTRY6) Entry not present Position */
#define DSU_ENTRY6_EPRES_1                    (DSU_ENTRY6_EPRES_1_Val << DSU_ENTRY6_EPRES_Pos)     /* (DSU_ENTRY6) Entry present Position */
#define DSU_ENTRY6_FMT_Pos                    _UINT32_(1)                                          /* (DSU_ENTRY6) CoreSight Rom Table Format Position */
#define DSU_ENTRY6_FMT_Msk                    (_UINT32_(0x1) << DSU_ENTRY6_FMT_Pos)                /* (DSU_ENTRY6) CoreSight Rom Table Format Mask */
#define DSU_ENTRY6_FMT(value)                 (DSU_ENTRY6_FMT_Msk & (_UINT32_(value) << DSU_ENTRY6_FMT_Pos)) /* Assignment of value for FMT in the DSU_ENTRY6 register */
#define   DSU_ENTRY6_FMT_0_Val                _UINT32_(0x0)                                        /* (DSU_ENTRY6) 8-bit format  */
#define   DSU_ENTRY6_FMT_1_Val                _UINT32_(0x1)                                        /* (DSU_ENTRY6) 32-bit format  */
#define DSU_ENTRY6_FMT_0                      (DSU_ENTRY6_FMT_0_Val << DSU_ENTRY6_FMT_Pos)         /* (DSU_ENTRY6) 8-bit format Position */
#define DSU_ENTRY6_FMT_1                      (DSU_ENTRY6_FMT_1_Val << DSU_ENTRY6_FMT_Pos)         /* (DSU_ENTRY6) 32-bit format Position */
#define DSU_ENTRY6_ADDOFF_Pos                 _UINT32_(12)                                         /* (DSU_ENTRY6) CoreSight ROM Table Address Offset Position */
#define DSU_ENTRY6_ADDOFF_Msk                 (_UINT32_(0xFFFFF) << DSU_ENTRY6_ADDOFF_Pos)         /* (DSU_ENTRY6) CoreSight ROM Table Address Offset Mask */
#define DSU_ENTRY6_ADDOFF(value)              (DSU_ENTRY6_ADDOFF_Msk & (_UINT32_(value) << DSU_ENTRY6_ADDOFF_Pos)) /* Assignment of value for ADDOFF in the DSU_ENTRY6 register */
#define DSU_ENTRY6_Msk                        _UINT32_(0xFFFFF003)                                 /* (DSU_ENTRY6) Register Mask  */


/* -------- DSU_ENTRY7 : (DSU Offset: 0x101C) ( R/ 32) CoreSight ROM Table Entry 7 Register -------- */
#define DSU_ENTRY7_RESETVALUE                 _UINT32_(0x00)                                       /*  (DSU_ENTRY7) CoreSight ROM Table Entry 7 Register  Reset Value */

#define DSU_ENTRY7_EPRES_Pos                  _UINT32_(0)                                          /* (DSU_ENTRY7) CoreSight Entry Present Position */
#define DSU_ENTRY7_EPRES_Msk                  (_UINT32_(0x1) << DSU_ENTRY7_EPRES_Pos)              /* (DSU_ENTRY7) CoreSight Entry Present Mask */
#define DSU_ENTRY7_EPRES(value)               (DSU_ENTRY7_EPRES_Msk & (_UINT32_(value) << DSU_ENTRY7_EPRES_Pos)) /* Assignment of value for EPRES in the DSU_ENTRY7 register */
#define   DSU_ENTRY7_EPRES_0_Val              _UINT32_(0x0)                                        /* (DSU_ENTRY7) Entry not present  */
#define   DSU_ENTRY7_EPRES_1_Val              _UINT32_(0x1)                                        /* (DSU_ENTRY7) Entry present  */
#define DSU_ENTRY7_EPRES_0                    (DSU_ENTRY7_EPRES_0_Val << DSU_ENTRY7_EPRES_Pos)     /* (DSU_ENTRY7) Entry not present Position */
#define DSU_ENTRY7_EPRES_1                    (DSU_ENTRY7_EPRES_1_Val << DSU_ENTRY7_EPRES_Pos)     /* (DSU_ENTRY7) Entry present Position */
#define DSU_ENTRY7_FMT_Pos                    _UINT32_(1)                                          /* (DSU_ENTRY7) CoreSight Rom Table Format Position */
#define DSU_ENTRY7_FMT_Msk                    (_UINT32_(0x1) << DSU_ENTRY7_FMT_Pos)                /* (DSU_ENTRY7) CoreSight Rom Table Format Mask */
#define DSU_ENTRY7_FMT(value)                 (DSU_ENTRY7_FMT_Msk & (_UINT32_(value) << DSU_ENTRY7_FMT_Pos)) /* Assignment of value for FMT in the DSU_ENTRY7 register */
#define   DSU_ENTRY7_FMT_0_Val                _UINT32_(0x0)                                        /* (DSU_ENTRY7) 8-bit format  */
#define   DSU_ENTRY7_FMT_1_Val                _UINT32_(0x1)                                        /* (DSU_ENTRY7) 32-bit format  */
#define DSU_ENTRY7_FMT_0                      (DSU_ENTRY7_FMT_0_Val << DSU_ENTRY7_FMT_Pos)         /* (DSU_ENTRY7) 8-bit format Position */
#define DSU_ENTRY7_FMT_1                      (DSU_ENTRY7_FMT_1_Val << DSU_ENTRY7_FMT_Pos)         /* (DSU_ENTRY7) 32-bit format Position */
#define DSU_ENTRY7_ADDOFF_Pos                 _UINT32_(12)                                         /* (DSU_ENTRY7) CoreSight ROM Table Address Offset Position */
#define DSU_ENTRY7_ADDOFF_Msk                 (_UINT32_(0xFFFFF) << DSU_ENTRY7_ADDOFF_Pos)         /* (DSU_ENTRY7) CoreSight ROM Table Address Offset Mask */
#define DSU_ENTRY7_ADDOFF(value)              (DSU_ENTRY7_ADDOFF_Msk & (_UINT32_(value) << DSU_ENTRY7_ADDOFF_Pos)) /* Assignment of value for ADDOFF in the DSU_ENTRY7 register */
#define DSU_ENTRY7_Msk                        _UINT32_(0xFFFFF003)                                 /* (DSU_ENTRY7) Register Mask  */


/* -------- DSU_MEMTYPE : (DSU Offset: 0x1FCC) ( R/ 32) CoreSight ROM Table Memory Type Register -------- */
#define DSU_MEMTYPE_RESETVALUE                _UINT32_(0x00)                                       /*  (DSU_MEMTYPE) CoreSight ROM Table Memory Type Register  Reset Value */

#define DSU_MEMTYPE_SYSMEM_Pos                _UINT32_(0)                                          /* (DSU_MEMTYPE) CoreSight System Memory Present Position */
#define DSU_MEMTYPE_SYSMEM_Msk                (_UINT32_(0x1) << DSU_MEMTYPE_SYSMEM_Pos)            /* (DSU_MEMTYPE) CoreSight System Memory Present Mask */
#define DSU_MEMTYPE_SYSMEM(value)             (DSU_MEMTYPE_SYSMEM_Msk & (_UINT32_(value) << DSU_MEMTYPE_SYSMEM_Pos)) /* Assignment of value for SYSMEM in the DSU_MEMTYPE register */
#define   DSU_MEMTYPE_SYSMEM_0_Val            _UINT32_(0x0)                                        /* (DSU_MEMTYPE) System memory not present on bus. This is a dedicated debug bus.  */
#define   DSU_MEMTYPE_SYSMEM_1_Val            _UINT32_(0x1)                                        /* (DSU_MEMTYPE) System memory is also present on this bus  */
#define DSU_MEMTYPE_SYSMEM_0                  (DSU_MEMTYPE_SYSMEM_0_Val << DSU_MEMTYPE_SYSMEM_Pos) /* (DSU_MEMTYPE) System memory not present on bus. This is a dedicated debug bus. Position */
#define DSU_MEMTYPE_SYSMEM_1                  (DSU_MEMTYPE_SYSMEM_1_Val << DSU_MEMTYPE_SYSMEM_Pos) /* (DSU_MEMTYPE) System memory is also present on this bus Position */
#define DSU_MEMTYPE_Msk                       _UINT32_(0x00000001)                                 /* (DSU_MEMTYPE) Register Mask  */


