Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/pic32cm_sg00_curiosity_pro_trustzone/pic32cm_sg00_curiosity_pro/src/packs/PIC32CM5112SG00100_DFP/component/dsu.h
/* -------- DSU_PID4 : (DSU Offset: 0x1FD0) ( R/ 32) CoreSight Peripheral Identification 4 Register -------- */
#define DSU_PID4_RESETVALUE                   _UINT32_(0x00)                                       /*  (DSU_PID4) CoreSight Peripheral Identification 4 Register  Reset Value */

#define DSU_PID4_DES2_Pos                     _UINT32_(0)                                          /* (DSU_PID4) CoreSight JEP106 Continuation Code Position */
#define DSU_PID4_DES2_Msk                     (_UINT32_(0xF) << DSU_PID4_DES2_Pos)                 /* (DSU_PID4) CoreSight JEP106 Continuation Code Mask */
#define DSU_PID4_DES2(value)                  (DSU_PID4_DES2_Msk & (_UINT32_(value) << DSU_PID4_DES2_Pos)) /* Assignment of value for DES2 in the DSU_PID4 register */
#define DSU_PID4_SIZE_Pos                     _UINT32_(4)                                          /* (DSU_PID4) CoreSight Size Position */
#define DSU_PID4_SIZE_Msk                     (_UINT32_(0xF) << DSU_PID4_SIZE_Pos)                 /* (DSU_PID4) CoreSight Size Mask */
#define DSU_PID4_SIZE(value)                  (DSU_PID4_SIZE_Msk & (_UINT32_(value) << DSU_PID4_SIZE_Pos)) /* Assignment of value for SIZE in the DSU_PID4 register */
#define DSU_PID4_Msk                          _UINT32_(0x000000FF)                                 /* (DSU_PID4) Register Mask  */


/* -------- DSU_PID5 : (DSU Offset: 0x1FD4) ( R/ 32) CoreSight Peripheral Identification 5 Register -------- */
#define DSU_PID5_RESETVALUE                   _UINT32_(0x00)                                       /*  (DSU_PID5) CoreSight Peripheral Identification 5 Register  Reset Value */

#define DSU_PID5_RES0_Pos                     _UINT32_(0)                                          /* (DSU_PID5) CoreSight Reserved Field Position */
#define DSU_PID5_RES0_Msk                     (_UINT32_(0xFF) << DSU_PID5_RES0_Pos)                /* (DSU_PID5) CoreSight Reserved Field Mask */
#define DSU_PID5_RES0(value)                  (DSU_PID5_RES0_Msk & (_UINT32_(value) << DSU_PID5_RES0_Pos)) /* Assignment of value for RES0 in the DSU_PID5 register */
#define DSU_PID5_Msk                          _UINT32_(0x000000FF)                                 /* (DSU_PID5) Register Mask  */


/* -------- DSU_PID6 : (DSU Offset: 0x1FD8) ( R/ 32) CoreSight Peripheral Identification 6 Register -------- */
#define DSU_PID6_RESETVALUE                   _UINT32_(0x00)                                       /*  (DSU_PID6) CoreSight Peripheral Identification 6 Register  Reset Value */

#define DSU_PID6_RES0_Pos                     _UINT32_(0)                                          /* (DSU_PID6) CoreSight Reserved Field Position */
#define DSU_PID6_RES0_Msk                     (_UINT32_(0xFF) << DSU_PID6_RES0_Pos)                /* (DSU_PID6) CoreSight Reserved Field Mask */
#define DSU_PID6_RES0(value)                  (DSU_PID6_RES0_Msk & (_UINT32_(value) << DSU_PID6_RES0_Pos)) /* Assignment of value for RES0 in the DSU_PID6 register */
#define DSU_PID6_Msk                          _UINT32_(0x000000FF)                                 /* (DSU_PID6) Register Mask  */


/* -------- DSU_PID7 : (DSU Offset: 0x1FDC) ( R/ 32) CoreSight Peripheral Identification 7 Register -------- */
#define DSU_PID7_RESETVALUE                   _UINT32_(0x00)                                       /*  (DSU_PID7) CoreSight Peripheral Identification 7 Register  Reset Value */

#define DSU_PID7_RES0_Pos                     _UINT32_(0)                                          /* (DSU_PID7) CoreSight Reserved Field Position */
#define DSU_PID7_RES0_Msk                     (_UINT32_(0xFF) << DSU_PID7_RES0_Pos)                /* (DSU_PID7) CoreSight Reserved Field Mask */
#define DSU_PID7_RES0(value)                  (DSU_PID7_RES0_Msk & (_UINT32_(value) << DSU_PID7_RES0_Pos)) /* Assignment of value for RES0 in the DSU_PID7 register */
#define DSU_PID7_Msk                          _UINT32_(0x000000FF)                                 /* (DSU_PID7) Register Mask  */


/* -------- DSU_PID0 : (DSU Offset: 0x1FE0) ( R/ 32) CoreSight Peripheral Identification 0 Register -------- */
#define DSU_PID0_RESETVALUE                   _UINT32_(0xD0)                                       /*  (DSU_PID0) CoreSight Peripheral Identification 0 Register  Reset Value */

#define DSU_PID0_PART0_Pos                    _UINT32_(0)                                          /* (DSU_PID0) CoreSight Part Number Bits[7:0] Position */
#define DSU_PID0_PART0_Msk                    (_UINT32_(0xFF) << DSU_PID0_PART0_Pos)               /* (DSU_PID0) CoreSight Part Number Bits[7:0] Mask */
#define DSU_PID0_PART0(value)                 (DSU_PID0_PART0_Msk & (_UINT32_(value) << DSU_PID0_PART0_Pos)) /* Assignment of value for PART0 in the DSU_PID0 register */
#define DSU_PID0_Msk                          _UINT32_(0x000000FF)                                 /* (DSU_PID0) Register Mask  */


/* -------- DSU_PID1 : (DSU Offset: 0x1FE4) ( R/ 32) CoreSight Peripheral Identification 1 Register -------- */
#define DSU_PID1_RESETVALUE                   _UINT32_(0x9C)                                       /*  (DSU_PID1) CoreSight Peripheral Identification 1 Register  Reset Value */

#define DSU_PID1_PART1_Pos                    _UINT32_(0)                                          /* (DSU_PID1) CoreSight Part Number Bits[11:8] Position */
#define DSU_PID1_PART1_Msk                    (_UINT32_(0xF) << DSU_PID1_PART1_Pos)                /* (DSU_PID1) CoreSight Part Number Bits[11:8] Mask */
#define DSU_PID1_PART1(value)                 (DSU_PID1_PART1_Msk & (_UINT32_(value) << DSU_PID1_PART1_Pos)) /* Assignment of value for PART1 in the DSU_PID1 register */
#define DSU_PID1_DES0_Pos                     _UINT32_(4)                                          /* (DSU_PID1) CoreSight JEP106 Identification Code Bits [3:0] Position */
#define DSU_PID1_DES0_Msk                     (_UINT32_(0xF) << DSU_PID1_DES0_Pos)                 /* (DSU_PID1) CoreSight JEP106 Identification Code Bits [3:0] Mask */
#define DSU_PID1_DES0(value)                  (DSU_PID1_DES0_Msk & (_UINT32_(value) << DSU_PID1_DES0_Pos)) /* Assignment of value for DES0 in the DSU_PID1 register */
#define DSU_PID1_Msk                          _UINT32_(0x000000FF)                                 /* (DSU_PID1) Register Mask  */


/* -------- DSU_PID2 : (DSU Offset: 0x1FE8) ( R/ 32) CoreSight Peripheral Identification 2 Register -------- */
#define DSU_PID2_RESETVALUE                   _UINT32_(0x0A)                                       /*  (DSU_PID2) CoreSight Peripheral Identification 2 Register  Reset Value */

#define DSU_PID2_DES1_Pos                     _UINT32_(0)                                          /* (DSU_PID2) CoreSight JEP106 Identification Code Bits [6:4] Position */
#define DSU_PID2_DES1_Msk                     (_UINT32_(0x7) << DSU_PID2_DES1_Pos)                 /* (DSU_PID2) CoreSight JEP106 Identification Code Bits [6:4] Mask */
#define DSU_PID2_DES1(value)                  (DSU_PID2_DES1_Msk & (_UINT32_(value) << DSU_PID2_DES1_Pos)) /* Assignment of value for DES1 in the DSU_PID2 register */
#define DSU_PID2_JEDEC_Pos                    _UINT32_(3)                                          /* (DSU_PID2) CoreSight JEDEC Assignment Position */
#define DSU_PID2_JEDEC_Msk                    (_UINT32_(0x1) << DSU_PID2_JEDEC_Pos)                /* (DSU_PID2) CoreSight JEDEC Assignment Mask */
#define DSU_PID2_JEDEC(value)                 (DSU_PID2_JEDEC_Msk & (_UINT32_(value) << DSU_PID2_JEDEC_Pos)) /* Assignment of value for JEDEC in the DSU_PID2 register */
#define DSU_PID2_REVISION_Pos                 _UINT32_(4)                                          /* (DSU_PID2) CoreSight Revision Position */
#define DSU_PID2_REVISION_Msk                 (_UINT32_(0xF) << DSU_PID2_REVISION_Pos)             /* (DSU_PID2) CoreSight Revision Mask */
#define DSU_PID2_REVISION(value)              (DSU_PID2_REVISION_Msk & (_UINT32_(value) << DSU_PID2_REVISION_Pos)) /* Assignment of value for REVISION in the DSU_PID2 register */
#define DSU_PID2_Msk                          _UINT32_(0x000000FF)                                 /* (DSU_PID2) Register Mask  */


/* -------- DSU_PID3 : (DSU Offset: 0x1FEC) ( R/ 32) CoreSight Peripheral Identification 3 Register -------- */
#define DSU_PID3_RESETVALUE                   _UINT32_(0x00)                                       /*  (DSU_PID3) CoreSight Peripheral Identification 3 Register  Reset Value */

#define DSU_PID3_CMOD_Pos                     _UINT32_(0)                                          /* (DSU_PID3) CoreSight Custom Modifier 0 Position */
#define DSU_PID3_CMOD_Msk                     (_UINT32_(0xF) << DSU_PID3_CMOD_Pos)                 /* (DSU_PID3) CoreSight Custom Modifier 0 Mask */
#define DSU_PID3_CMOD(value)                  (DSU_PID3_CMOD_Msk & (_UINT32_(value) << DSU_PID3_CMOD_Pos)) /* Assignment of value for CMOD in the DSU_PID3 register */
#define DSU_PID3_REVAND_Pos                   _UINT32_(4)                                          /* (DSU_PID3) CoreSight REVAND Position */
#define DSU_PID3_REVAND_Msk                   (_UINT32_(0xF) << DSU_PID3_REVAND_Pos)               /* (DSU_PID3) CoreSight REVAND Mask */
#define DSU_PID3_REVAND(value)                (DSU_PID3_REVAND_Msk & (_UINT32_(value) << DSU_PID3_REVAND_Pos)) /* Assignment of value for REVAND in the DSU_PID3 register */
#define DSU_PID3_Msk                          _UINT32_(0x000000FF)                                 /* (DSU_PID3) Register Mask  */


/* -------- DSU_CID0 : (DSU Offset: 0x1FF0) ( R/ 32) CoreSight Component Identification 0 Register -------- */
#define DSU_CID0_RESETVALUE                   _UINT32_(0x0D)                                       /*  (DSU_CID0) CoreSight Component Identification 0 Register  Reset Value */

