Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/pic32cm_sg00_curiosity_pro_trustzone/pic32cm_sg00_curiosity_pro/src/packs/PIC32CM5112SG00100_DFP/component/dsu.h
#define DSU_CID0_PRMBL0_Pos                   _UINT32_(0)                                          /* (DSU_CID0) CoreSight Preamble 0 Position */
#define DSU_CID0_PRMBL0_Msk                   (_UINT32_(0xFF) << DSU_CID0_PRMBL0_Pos)              /* (DSU_CID0) CoreSight Preamble 0 Mask */
#define DSU_CID0_PRMBL0(value)                (DSU_CID0_PRMBL0_Msk & (_UINT32_(value) << DSU_CID0_PRMBL0_Pos)) /* Assignment of value for PRMBL0 in the DSU_CID0 register */
#define DSU_CID0_Msk                          _UINT32_(0x000000FF)                                 /* (DSU_CID0) Register Mask  */


/* -------- DSU_CID1 : (DSU Offset: 0x1FF4) ( R/ 32) CoreSight Component Identification 1 Register -------- */
#define DSU_CID1_RESETVALUE                   _UINT32_(0x10)                                       /*  (DSU_CID1) CoreSight Component Identification 1 Register  Reset Value */

#define DSU_CID1_PRMBL1_Pos                   _UINT32_(0)                                          /* (DSU_CID1) CoreSight Preamble 1 Position */
#define DSU_CID1_PRMBL1_Msk                   (_UINT32_(0xF) << DSU_CID1_PRMBL1_Pos)               /* (DSU_CID1) CoreSight Preamble 1 Mask */
#define DSU_CID1_PRMBL1(value)                (DSU_CID1_PRMBL1_Msk & (_UINT32_(value) << DSU_CID1_PRMBL1_Pos)) /* Assignment of value for PRMBL1 in the DSU_CID1 register */
#define DSU_CID1_CCLASS_Pos                   _UINT32_(4)                                          /* (DSU_CID1) CoreSight Component Class Position */
#define DSU_CID1_CCLASS_Msk                   (_UINT32_(0xF) << DSU_CID1_CCLASS_Pos)               /* (DSU_CID1) CoreSight Component Class Mask */
#define DSU_CID1_CCLASS(value)                (DSU_CID1_CCLASS_Msk & (_UINT32_(value) << DSU_CID1_CCLASS_Pos)) /* Assignment of value for CCLASS in the DSU_CID1 register */
#define DSU_CID1_Msk                          _UINT32_(0x000000FF)                                 /* (DSU_CID1) Register Mask  */


/* -------- DSU_CID2 : (DSU Offset: 0x1FF8) ( R/ 32) CoreSight Component Identification 2 Register -------- */
#define DSU_CID2_RESETVALUE                   _UINT32_(0x05)                                       /*  (DSU_CID2) CoreSight Component Identification 2 Register  Reset Value */

#define DSU_CID2_PRMBL2_Pos                   _UINT32_(0)                                          /* (DSU_CID2) CoreSight Preamble 2 Position */
#define DSU_CID2_PRMBL2_Msk                   (_UINT32_(0xFF) << DSU_CID2_PRMBL2_Pos)              /* (DSU_CID2) CoreSight Preamble 2 Mask */
#define DSU_CID2_PRMBL2(value)                (DSU_CID2_PRMBL2_Msk & (_UINT32_(value) << DSU_CID2_PRMBL2_Pos)) /* Assignment of value for PRMBL2 in the DSU_CID2 register */
#define DSU_CID2_Msk                          _UINT32_(0x000000FF)                                 /* (DSU_CID2) Register Mask  */


/* -------- DSU_CID3 : (DSU Offset: 0x1FFC) ( R/ 32) CoreSight Component Identification 3 Register -------- */
#define DSU_CID3_RESETVALUE                   _UINT32_(0xB1)                                       /*  (DSU_CID3) CoreSight Component Identification 3 Register  Reset Value */

#define DSU_CID3_PRMBL3_Pos                   _UINT32_(0)                                          /* (DSU_CID3) CoreSight Preamble 3 Position */
#define DSU_CID3_PRMBL3_Msk                   (_UINT32_(0xFF) << DSU_CID3_PRMBL3_Pos)              /* (DSU_CID3) CoreSight Preamble 3 Mask */
#define DSU_CID3_PRMBL3(value)                (DSU_CID3_PRMBL3_Msk & (_UINT32_(value) << DSU_CID3_PRMBL3_Pos)) /* Assignment of value for PRMBL3 in the DSU_CID3 register */
#define DSU_CID3_Msk                          _UINT32_(0x000000FF)                                 /* (DSU_CID3) Register Mask  */


/* DSU register offsets definitions */
#define DSU_CTRLA_REG_OFST             _UINT32_(0x00)      /* (DSU_CTRLA) Control A REGISTER Offset */
#define DSU_CTRLB_REG_OFST             _UINT32_(0x04)      /* (DSU_CTRLB) Control B REGISTER Offset */
#define DSU_CTRLC_REG_OFST             _UINT32_(0x100)     /* (DSU_CTRLC) Control C REGISTER Offset */
#define DSU_STATUSA_REG_OFST           _UINT32_(0x104)     /* (DSU_STATUSA) Status A REGISTER Offset */
#define DSU_STATUSB_REG_OFST           _UINT32_(0x108)     /* (DSU_STATUSB) Status B REGISTER Offset */
#define DSU_BCC_REG_OFST               _UINT32_(0x110)     /* (DSU_BCC) Boot ROM Channel n REGISTER Offset */
#define DSU_BCC0_REG_OFST              _UINT32_(0x110)     /* (DSU_BCC0) Boot ROM Channel n REGISTER Offset */
#define DSU_BCC1_REG_OFST              _UINT32_(0x114)     /* (DSU_BCC1) Boot ROM Channel n REGISTER Offset */
#define DSU_DCC_REG_OFST               _UINT32_(0x118)     /* (DSU_DCC) Debug Communication Channel n REGISTER Offset */
#define DSU_DCC0_REG_OFST              _UINT32_(0x118)     /* (DSU_DCC0) Debug Communication Channel n REGISTER Offset */
#define DSU_DCC1_REG_OFST              _UINT32_(0x11C)     /* (DSU_DCC1) Debug Communication Channel n REGISTER Offset */
#define DSU_DID_REG_OFST               _UINT32_(0x120)     /* (DSU_DID) Device Identification Register Offset */
#define DSU_DAL_REG_OFST               _UINT32_(0x124)     /* (DSU_DAL) Debugger Access Level REGISTER Offset */
#define DSU_ENTRY0_REG_OFST            _UINT32_(0x1000)    /* (DSU_ENTRY0) CoreSight ROM Table Entry N Register Offset */
#define DSU_ENTRY1_REG_OFST            _UINT32_(0x1004)    /* (DSU_ENTRY1) CoreSight ROM Table Entry N Register Offset */
#define DSU_ENTRY2_REG_OFST            _UINT32_(0x1008)    /* (DSU_ENTRY2) CoreSight ROM Table Entry N Register Offset */
#define DSU_ENTRY3_REG_OFST            _UINT32_(0x100C)    /* (DSU_ENTRY3) CoreSight ROM Table Entry N Register Offset */
#define DSU_ENTRY4_REG_OFST            _UINT32_(0x1010)    /* (DSU_ENTRY4) CoreSight ROM Table Entry 4 Register Offset */
#define DSU_ENTRY5_REG_OFST            _UINT32_(0x1014)    /* (DSU_ENTRY5) CoreSight ROM Table Entry 5 Register Offset */
#define DSU_ENTRY6_REG_OFST            _UINT32_(0x1018)    /* (DSU_ENTRY6) CoreSight ROM Table Entry 6 Register Offset */
#define DSU_ENTRY7_REG_OFST            _UINT32_(0x101C)    /* (DSU_ENTRY7) CoreSight ROM Table Entry 7 Register Offset */
#define DSU_MEMTYPE_REG_OFST           _UINT32_(0x1FCC)    /* (DSU_MEMTYPE) CoreSight ROM Table Memory Type Register Offset */
#define DSU_PID4_REG_OFST              _UINT32_(0x1FD0)    /* (DSU_PID4) CoreSight Peripheral Identification 4 Register Offset */
#define DSU_PID5_REG_OFST              _UINT32_(0x1FD4)    /* (DSU_PID5) CoreSight Peripheral Identification 5 Register Offset */
#define DSU_PID6_REG_OFST              _UINT32_(0x1FD8)    /* (DSU_PID6) CoreSight Peripheral Identification 6 Register Offset */
#define DSU_PID7_REG_OFST              _UINT32_(0x1FDC)    /* (DSU_PID7) CoreSight Peripheral Identification 7 Register Offset */
#define DSU_PID0_REG_OFST              _UINT32_(0x1FE0)    /* (DSU_PID0) CoreSight Peripheral Identification 0 Register Offset */
#define DSU_PID1_REG_OFST              _UINT32_(0x1FE4)    /* (DSU_PID1) CoreSight Peripheral Identification 1 Register Offset */
#define DSU_PID2_REG_OFST              _UINT32_(0x1FE8)    /* (DSU_PID2) CoreSight Peripheral Identification 2 Register Offset */
#define DSU_PID3_REG_OFST              _UINT32_(0x1FEC)    /* (DSU_PID3) CoreSight Peripheral Identification 3 Register Offset */
#define DSU_CID0_REG_OFST              _UINT32_(0x1FF0)    /* (DSU_CID0) CoreSight Component Identification 0 Register Offset */
#define DSU_CID1_REG_OFST              _UINT32_(0x1FF4)    /* (DSU_CID1) CoreSight Component Identification 1 Register Offset */
#define DSU_CID2_REG_OFST              _UINT32_(0x1FF8)    /* (DSU_CID2) CoreSight Component Identification 2 Register Offset */
#define DSU_CID3_REG_OFST              _UINT32_(0x1FFC)    /* (DSU_CID3) CoreSight Component Identification 3 Register Offset */

