Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/pic32cm_sg00_curiosity_pro_trustzone/pic32cm_sg00_curiosity_pro/src/packs/PIC32CM5112SG00100_DFP/component/dsu.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/* DSU register API structure */
typedef struct
{  /* Polaris Device Services Unit Macro DOS */
  __IO  uint32_t                       DSU_CTRLA;          /* Offset: 0x00 (R/W  32) Control A REGISTER */
  __IO  uint32_t                       DSU_CTRLB;          /* Offset: 0x04 (R/W  32) Control B REGISTER */
  __I   uint8_t                        Reserved1[0xF8];
  __IO  uint32_t                       DSU_CTRLC;          /* Offset: 0x100 (R/W  32) Control C REGISTER */
  __IO  uint32_t                       DSU_STATUSA;        /* Offset: 0x104 (R/W  32) Status A REGISTER */
  __I   uint32_t                       DSU_STATUSB;        /* Offset: 0x108 (R/   32) Status B REGISTER */
  __I   uint8_t                        Reserved2[0x04];
  __IO  uint32_t                       DSU_BCC[2];         /* Offset: 0x110 (R/W  32) Boot ROM Channel n REGISTER */
  __IO  uint32_t                       DSU_DCC[2];         /* Offset: 0x118 (R/W  32) Debug Communication Channel n REGISTER */
  __IO  uint32_t                       DSU_DID;            /* Offset: 0x120 (R/W  32) Device Identification Register */
  __I   uint32_t                       DSU_DAL;            /* Offset: 0x124 (R/   32) Debugger Access Level REGISTER */
  __I   uint8_t                        Reserved3[0xED8];
  __I   uint32_t                       DSU_ENTRY0;         /* Offset: 0x1000 (R/   32) CoreSight ROM Table Entry N Register */
  __I   uint32_t                       DSU_ENTRY1;         /* Offset: 0x1004 (R/   32) CoreSight ROM Table Entry N Register */
  __I   uint32_t                       DSU_ENTRY2;         /* Offset: 0x1008 (R/   32) CoreSight ROM Table Entry N Register */
  __I   uint32_t                       DSU_ENTRY3;         /* Offset: 0x100C (R/   32) CoreSight ROM Table Entry N Register */
  __I   uint32_t                       DSU_ENTRY4;         /* Offset: 0x1010 (R/   32) CoreSight ROM Table Entry 4 Register */
  __I   uint32_t                       DSU_ENTRY5;         /* Offset: 0x1014 (R/   32) CoreSight ROM Table Entry 5 Register */
  __I   uint32_t                       DSU_ENTRY6;         /* Offset: 0x1018 (R/   32) CoreSight ROM Table Entry 6 Register */
  __I   uint32_t                       DSU_ENTRY7;         /* Offset: 0x101C (R/   32) CoreSight ROM Table Entry 7 Register */
  __I   uint8_t                        Reserved4[0xFAC];
  __I   uint32_t                       DSU_MEMTYPE;        /* Offset: 0x1FCC (R/   32) CoreSight ROM Table Memory Type Register */
  __I   uint32_t                       DSU_PID4;           /* Offset: 0x1FD0 (R/   32) CoreSight Peripheral Identification 4 Register */
  __I   uint32_t                       DSU_PID5;           /* Offset: 0x1FD4 (R/   32) CoreSight Peripheral Identification 5 Register */
  __I   uint32_t                       DSU_PID6;           /* Offset: 0x1FD8 (R/   32) CoreSight Peripheral Identification 6 Register */
  __I   uint32_t                       DSU_PID7;           /* Offset: 0x1FDC (R/   32) CoreSight Peripheral Identification 7 Register */
  __I   uint32_t                       DSU_PID0;           /* Offset: 0x1FE0 (R/   32) CoreSight Peripheral Identification 0 Register */
  __I   uint32_t                       DSU_PID1;           /* Offset: 0x1FE4 (R/   32) CoreSight Peripheral Identification 1 Register */
  __I   uint32_t                       DSU_PID2;           /* Offset: 0x1FE8 (R/   32) CoreSight Peripheral Identification 2 Register */
  __I   uint32_t                       DSU_PID3;           /* Offset: 0x1FEC (R/   32) CoreSight Peripheral Identification 3 Register */
  __I   uint32_t                       DSU_CID0;           /* Offset: 0x1FF0 (R/   32) CoreSight Component Identification 0 Register */
  __I   uint32_t                       DSU_CID1;           /* Offset: 0x1FF4 (R/   32) CoreSight Component Identification 1 Register */
  __I   uint32_t                       DSU_CID2;           /* Offset: 0x1FF8 (R/   32) CoreSight Component Identification 2 Register */
  __I   uint32_t                       DSU_CID3;           /* Offset: 0x1FFC (R/   32) CoreSight Component Identification 3 Register */
} dsu_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _PIC32CMSG00_DSU_COMPONENT_H_ */
